#include <stdio.h>

int main()
{
/* Първият въпрос, който трябва да се питаме е - Как разбираме дали едно число е четно?
Това можем да го проверим като използваме оператор '%' и разделим числото на 2.
Ако числото е четно, тогава резултатът от делението ще е нулевият остатък, защото четните числа се делят без остатък на 2.
Ако числото е нечетно, остатъкът ще бъде 1. */

int a;
scanf("%d", &a);
printf("The number is : %d" , a % 2); /* Принтираме директно резултатът от израза, защото той ни дава директно 0 или 1,
                                             което е изходът, който точно търсим. */

return 0;
}
