#include <stdio.h>

int main() {
    int n;
    scanf("%d", &n);

    /* Както в предишната задача взимаме трите цифри по отделно.*/
    int d1 = n / 100;
    int d2 = (n / 10) % 10;
    int d3 = n % 10;

    /*За да обърнем числото, просто го конструираме наобратно като умножим последната
     цифра * 100, за да мине най-отпред и съответно средната цифра * 10 и последната + 1.*/
    int reversedPlusOne = (d3 * 100) + (d2 * 10) + d1 + 1;

    printf("%d\n", reversedPlusOne);
    return 0;
}