#include <stdio.h>

int main() {
    int a, b, c, d, e;
    scanf("%d %d %d %d %d", &a, &b, &c, &d, &e);

    /* По същата логика както предишните задачи
       Ако числото е четно, изразът (_ % 2 != 0) ще се изчисли до лъжа тоест 0 съответно
       произведението ще е равно на 0. Така
       ще се съберат само числата, които са нечетни и ще се върне тяхната сума.
     */

    int sum = ((a % 2 != 0) * a) +
              ((b % 2 != 0) * b) +
              ((c % 2 != 0) * c) +
              ((d % 2 != 0) * d) +
              ((e % 2 != 0) * e);

    printf("%d\n", sum);

    return 0;
}